#+BEGIN_EXPORT html
---
layout: page
title: Linux Process Management
tagline: " how it works"
permalink: /linux/debian12/process-management-in-linux.html
categories: [Debian12, Process Management]
tags: [linux, process-management]
---
#+END_EXPORT

#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 2
#+PROPERTY:header-args :results output :exports both :eval no-export

** ps (Process Status) command

It displays the currently-running processes. However, unlike the top
command, the output generated is not in realtime.

#+begin_src sh
  ps
#+end_src

#+RESULTS:
#+begin_example
    PID TTY          TIME CMD
 904296 ?        00:00:01 systemd
 904299 ?        00:00:00 (sd-pam)
 904327 ?        00:22:33 pipewire
 904329 ?        00:00:33 wireplumber
 904330 ?        00:37:35 pipewire-pulse
 904336 ?        00:00:00 gnome-keyring-d
 904339 ?        00:00:05 dbus-daemon
 +end_example

 PID  process ID
 TTY  terminal type
 TIME  total time the process has been running
 CMD  name of the command that launches the process

 To get more information using ps command use:

#+begin_src sh
ps -u
#+end_src

#+RESULTS:
: USER         PID %CPU %MEM    VSZ   RSS TTY      STAT START   TIME COMMAND
: vikky     904412  0.0  0.0 159448  5492 tty7     Ssl+ Mar29   0:00 /usr/libexec/gdm-wayland-session /usr/bin/gnome-session
: vikky     904419  0.0  0.0 298124  8996 tty7     Sl+  Mar29   0:00 /usr/libexec/gnome-session-binary
: vikky    1040034  0.0  0.0   8256  3016 tty5     S    Apr02   0:00 -bash
: vikky    1040081  4.1  0.0  13888  9624 tty5     S+   Apr02 650:28 htop
: vikky    1078991  0.0  0.0   8260  3096 pts/8    Ss   Apr03   0:00 bash
: vikky    1145414  0.0  0.0   8388  4176 pts/10   Ss+  Apr05   0:00 bash
: vikky    1245913  0.0  1.2 782744 196792 pts/8   S+   Apr08   5:01 emacs -nw
: vikky    1264653  0.0  0.0   8152  2960 pts/12   Ss+  Apr08   0:00 /bin/bash --noediting -i

%CPU represents the amount of computing power the process is taking.
%MEM represents the amount of memory the process is taking up.
STAT represents process state

While ps command only displays the processes that are currently
running, you can also use it to list all the processes.

#+begin_src sh
ps -A
#+end_src

You can use =ps aux= to get more in-depth information about your
running processes.

- a option outputs all running processes of all users in the system;
- u option provides additional information like memory and CPU usage
  percentage, the process state code, and the owner of the processes;
- x option lists all processes not executed from the terminal. A
  perfect example of this are daemons, which are system-related
  processes that run in the background when the system is booted up.

  #+begin_src sh
    ps -aux | grep ssh
  #+end_src

  #+RESULTS:
  : alioth      1793  0.0  0.0  88372  4408 ?        Ssl  Mar05   0:00 /usr/libexec/gcr-ssh-agent /run/user/1000/gcr
  : alioth      1795  0.0  0.0   7800  1876 ?        Ss   Mar05   0:00 ssh-agent -D -a /run/user/1000/openssh_agent
  : vikky     904481  0.0  0.0  88372  4700 ?        Ssl  Mar29   0:00 /usr/libexec/gcr-ssh-agent /run/user/1001/gcr
  : vikky     904485  0.0  0.0   7800  2636 ?        Ss   Mar29   0:00 ssh-agent -D -a /run/user/1001/openssh_agent
  : vikky    1079495  0.0  0.0   7800  2928 ?        S    Apr03   0:00 /usr/bin/ssh-agent -D -a /run/user/1001/keyring/.ssh
  : root     1399815  0.0  0.0  15412  7160 ?        Ss   Apr13   0:00 sshd: /usr/sbin/sshd -D [listener] 0 of 10-100 startups
  : vikky    1437823  0.0  0.0   6472  2080 ?        S    07:33   0:00 grep ssh

  #+begin_src sh
    ps -aux | grep sshd
  #+end_src

  #+RESULTS:
  : root     1399815  0.0  0.0  15412  7160 ?        Ss   Apr13   0:00 sshd: /usr/sbin/sshd -D [listener] 0 of 10-100 startups
  : vikky    1442624  0.0  0.0   6472  2132 ?        S    08:44   0:00 grep sshd


